---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowMonolithicSupportGeom
source: html/90411ecc-c3df-8879-5866-51ac01859ebe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowMonolithicSupportGeom Property

"Show Monolithic Support Geometry"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowMonolithicSupportGeom { get; }
```